[
    {
        "title": "Theology 103",
        "date": 1644825601000,
        "id":  "theology-103-week-5",
        "tags": 
        [
            "Theology","Christ","Sin","Angels","Demons"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 5: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Satan can serve God's purposes in the realm of church discipline when repentance remains absent",
                            "Believers are to gird up the loins with truth which show they have a heart for battle because of their commitment to Christ",
                            "God has provided the breastplate of righteousness to protect the believer's mind and emotions",
                            "Though Satan and one-third of the angel disqualified themselves from servest to the LORD, they weren't completely banned from heaven",
                            "Satan will only bruise Christ heel (cause Him to suffer), while Christ will bruise Satan's head (destroy him with a fatal blow)",
                            "When someone is demonize, the demon exercise living and dominant control over that person",
                            "The sealing ministry of the Holy Spirit protects Christians against demon invasion, and its unbiblical and impossible for a true believer to have a demon invasion",
                            "Demonization refers to the only unbelievers in whom a demon resides",
                            "Believers can be tormented, oppressed, and harassed externally, even to to severe degree like Saul",
                            "A demon is far more powerful than a human so we must trust the appeal to God in prayer to deal with situation of demonization",
                            "The angel of the LORD has been identified as a special created angel, some say Michael the archangel, but no created angel has ever show traits of deity",
                            "Also the angel of the LORD is a self-manifestation of Yahweh himself",
                            "The angel of the LORD showed traits of deity (Ex, 3:2-5; Judg. 13:17-18; Ex. 23:21;33:14; Isa. 63:9)",
                            "The identification of the angel of the LORD matches the NT explanation of the preincarnate Christ",
                            "The words uttered by Christ asserts that He was the angel of the LORD mentioned in the OT because it asserts that more than one person can be God",
                            "The attributes of the OT angel of the LORD compare perfectly with those of Christ"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "How can demons be pictured in today's age, such as in a homeless person who is talking to themselves, or can it be your average person?",
                            "If one is demon possessed what do we do as Christians?",
                            "Will the Antichrist be some type of leader like the king of Babylon in Isaiah 14?",
                            "What portion in man's sinful action is Satan or demon deception; or just the man's own sinfulness? (The Devil made me do it theology)"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 103",
        "date": 1644220801000,
        "id":  "theology-103-week-4",
        "tags": 
        [
            "Theology","Christ","Sin","Angels","Demons"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 4: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Angels(both holy and evil) were created at the start of creation and the demons fell somewhere after the seven day creation and prior to the fall. They existed with a set number and 1/3 of them falling",
                            "The term “heaven” in scripture describes three different elevation levels above earth.",
                            "“Third heaven” normally known as paradise where God resides",
                            "“Second heaven” where the sun, moon, and stars reside",
                            "“First heaven” earth's atmosphere",
                            "Angels are ministering spirits this is presented in Heb. 1:14",
                            "“God of this world” is Satan and he has superior power, but not deity. This title comes by virtue not his position nor his nature. The reason behind the title is Satan's work in the garden that cause the fall, and he is behind all false religions",
                            "Satan's messages and activities are all built on deception and lies (1 Ki. 22:21-23)",
                            "God used Satan to deceive Israel's King Ahab to go into battle which led to Ahab's death",
                            "Satan and other demonic minions were most intensely engaged during Christ's earthly ministry",
                            "Satan operates as the unrivaled master of disguise who also mimics and imitates the holy things of God, but gives his cheap version, which lures people to himself",
                            "Satan wages an invisible spiritual war using deceitful and clever tactics",
                            "Satan's target is the human mind more importantly the Christian's mind as he plays mind games with them",
                            "Satan attempt to distort or deny the truth God's Word by sensualism, sensationalism, universalism, rationalism, existentialism, illusionism, ecumenism, humanism",
                            "The question that Satan asked Eve in the garden was not a research question, but rather a ridicule",
                            "Ex: You've got to be kidding, Eve. God didn't really say you can't eat from any tree in the garden, did he?",
                            "In the moment when Eve was deceived God's Word was no longer authoritative in her life now that she had an alternative"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "How can demons be pictured in today's age, such as in a homeless person who is talking to themselves, or can it be your average person?",
                            "If one is demon possessed what do we do as Christians?",
                            "Will the Antichrist be some type of leader like the king of Babylon in Isaiah 14?",
                            "What portion in man’s sinful action is Satan or demon deception; or just the man’s own sinfulness? (The Devil made me do it theology)"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 103",
        "date": 1643616001000,
        "id":  "theology-103-week-3",
        "tags": 
        [
            "Theology","Christ","Sin"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 3: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "Since the enlightenment, humans have thought of themselves as inherently \"good\".",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Society presents sin as stemming from the personal environment they grew up in. So if you grew up in a rough environment you are likely to be a greater sinner than someone in a good environment.",
                            "From a biblical understanding sin is man usurping God's authority and acting as they are autonomist",
                            "Both Satan and Adam were unsatisfied with their perfect condition, and the rebelled and desired to be like God",
                            "There are three types of death: spiritual death(every unbeliever), physical death(everyone will face unless they are raptured), eternal death(final result for the unbeliever)",
                            "Original sin not only includes the first sin that Adam commit, but also it include the state of people who descended from Adam",
                            "Transmission of Adam sin seems to be best fit with the representative view. Representative headship asserts that the action of a representative results is seen as the action also for those united to him.",
                            "The action of our federal head lead to not only a sinful nature, but also our condemnation, so in the same the action by our new federal head Christ we receive life. (Rom. 5; 1 Cor. 15)",
                            "Total depravity does not conclude that man is not able to do good rather it teaches that the corruption of sin pollutes the person. Both body and spirit are corrupted by sin",
                            "Man is not relatively neutral in which they are able to accept or reject God. Man is a hater of God who can not understand the things of God",
                            "The \"sin that leads to death\" is a sin that lead to drastic chastisement",
                            "Mortal and Venial sins are antithetical to the bible because it supposes that there are some sins that will not lead to condemnation which in turn leads to a faulty salvation",
                            "The Roman Catholic idea of meritorious penance which is used for removal of mortal sin is an error and takes a blow at Christ atoning sacrifice for sin",
                            "Personal sin does not break the bond between them and Christ, but they do have a negative impact on communion with Christ",
                            "God created the world perfect, the reason the world is the way it is, is because man has to face the consequences for their sin",
                            "The truth gives eternal perspective to our temporal sufferings in a fallen world"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "Is this denial from this British monk the reason why so many believe in free will?",
                            "In understanding the a-mil or post-mil position on the end times, how can it be that the man of lawlessness isn't literally or has already come and deceived?",
                            "Why was the woman promised the coming seed that would reverse the curse?",
                            "Why did God not destroy all man again as he did in the flood even though man remained sinful as we see even Noah was sinful?"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 103",
        "date": 1643011201000,
        "id":  "theology-103-week-2",
        "tags": 
        [
            "Theology","Christ","Sin"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 3: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "Since the enlightenment, humans have thought of themselves as inherently \"good\".",
                    "These are the following learning that I was grateful to learn about this week in my study on humans and sin: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": ""
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Anthropology helps me with understanding who I am as a person. This answers the question of why we all are here.",
                            "Anthropology also helps with dealing with the time such as what Charles Spurgen dealt with evolution starting with Charles Darwin. This is where I am happy to learn about sudden creationism",
                            "I noticed while going through Genesis 1 were the terms created, made, and formed. This was eye opening because I sometimes can gloss over these terms while reading and miss God's magnificent glory in creation",
                            "Imago Dei is a unique difference that we humans possess that all other creatures and animals don’t possess. We are his representation not in the divine sense, but in the sense of the Trinitrian nature how we live in relationship with others",
                            "Our conscience can get overridden by lies and errors which in turn misinforms the conscience",
                            "Scripture seems to support dichotomy and trichotomy where sometimes soul and spirit are interchangeable and other times they are not so interchangeable, but mean different things",
                            "Creationism argument when it comes to the origin of the soul fails to understand that Adam creation is a unique creation, so using him for the argument that both the soul and body were created at the same time is wrong.",
                            "Deut. 22:5 supports that God expects that said person to live according to the gender He granted them at birth",
                            "After the creatures were created God seemed to still create Adam a helper, so we see that the creatures and animals weren't suitable for him",
                            "Homosexual unions cannot be rightly seen as marriages because it goes against God meaning for marriage",
                            "sub: He create man and seen that man needed a companion and this companion must fulfill His command to procreate",
                            "Ex. 21:22-25 presents a strong case for life starting in the womb because of the severity of the punishment if the child in the mother is harmed.",
                            "The soul/spirit lives in an intermediate state between death and bodily resurrection"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "Can one human constitution affect another human constitution?",
                            "Similar to man initial command and go and fill the earth which they disobey which led to Gen. 11 in which they gathered in one place; is our command to go and make disciples of all nations can we be disobedient if we stick to trying to make disciples and our household and extended families?",
                            "When talking about the role of government, is it wrong to disobey when they constitute something as being wrong such as the latest Canadian bill even though they are in place to punish people who do wrong?"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 102",
        "date": 1639369440000,
        "id":  "theology-102-week-6",
        "tags": 
        [
            "Theology","Christ","God"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "CHRISTOLOGY PT.2"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Doxologies of the NT ascribe the same glory and honor to Christ as was thecommonality to ascribe to God in the OT (1 Chr. 29:10-11;1 Pet. 4:11;2 Pet. 3:18)",
                            "Jesus instructs His disciples to pray to Him(Jh. 14:14;15:16;16:23-24) and we look at those passage we see that He describes Himself as our mediator between God and man",
                            "Christ in emptying Himself in Phil. 2 did not empty Himself of His deity, but rather emptying by addition, not subtraction, by becoming man",
                            "The Son of God fully possessed His divine nature, attributes, and prerogatives, he did not fully express them. They were veiled to be revealed by Him when he wanted",
                            "Christ surrender the glories from which He came, from being worshipped by saints and angels to mocked by men",
                            "Both Jesus's divine nature and human nature possesses their own will. (Jh. 17:24) His divine will; (Mat. 26:39) His human will",
                            "His limited knowledge such as in passage like Mark 13 is a result of His voluntary surrender of the independent use of His divine attributes",
                            "Jesus was baptized in order to fulfill the Father's will. He in turned identified Himself with sinners to ultimately bear their sins",
                            "Jesus veiling the truth in parables acted as both judgement and mercy for the hearers. Judgement because it kept them in darkness and mercy because He grant them to see the light of God",
                            "God prepared mankind for the atoning substitutionary sacrifice;of Christ by providing the instructions about sacrifice",
                            "The display of Jesus's glory is most often associated with His second advent, not His resurrection",
                            "Glory in the minds of the prophets and apostles were mostly associated with Christ's resurrection",
                            "The believers resurrection they share in the same glory",
                            "Every believer is ultimately accountable to him (1 Cor. 3:10-15) which motivates us to please God",
                            "At the fullness of time, God will gather together believers in the millennial kingdom",
                            "The real glory of eternity is when believers will reside in the presence of the Lord"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "Is this denial from this British monk the reason why so many believe in free will?",
                            "In understanding the a-mil or post-mil position on the end times, how can it be that the man of lawlessness isn't literally or has already come and deceived?",
                            "Why was the woman promised the coming seed that would reverse the curse?",
                            "Why did God not destroy all man again as he did in the flood even though man remained sinful as we see even Noah was sinful?"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 102",
        "date": 1638636277590,
        "id":  "theology-102-week-5",
        "tags": 
        [
            "Theology","Christ","God"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "CHRISTOLOGY PT.2"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Christ is eternally begotten from the Father, this is not speaking that Christ had a beginning because that goes against John 1:2-3",
                            "Begotten in an eternal sense is speaking of the relationship of the First and Second person of the Trinity",
                            "The Holy Spirit is not begotten, but rather procession",
                            "When talking about order in the Trinity we are not speaking of glory, majesty, or essence, but rather with relationship",
                            "The word Trinity is not found in found in Scripture but it is based on the biblical verbiage presented",
                            "The doctrine of the Trinity was formally articulated by the Councils of Nicea(AD 325) and Constantinople(AD 381), but weren't invented here",
                            "The term arised to combat heresies that were arising from Gnosticism and Monarchianism",
                            "Christ (Second person of the Trinity) was sent from the Father as a result of God's love for mankind (John 3:16)",
                            "Christ has always existed as the Son of God but became a child only at the moment of His miraculous conception",
                            "\"Son of God\" title was understood categorically by everyone as a title of deity",
                            "Theophany meaning appearance of God usually is referred to the old testament and are seen in passage like Gen. 16: 7-3 and has to be seen through the author rather than the character",
                            "As we read John 1:18 we see that \"no one has seen God...,he has made him known\" made known in greek ( ex geomai )",
                            "Jesus (the Son of God) made the Father known to mankind",
                            "We see Christ intervening in history when mankind rebelled along with establishing the Kingdom of God on earth",
                            "The point of the word \"God-breathed\" points to the origin of Scripture which is the divine breath of the Holy Spirit",
                            "The Son of God appears as the one speaking to the people both in the OT and NT",
                            "Christ is the theophany giving revelation by means of His personal presence",
                            "The Spirit plays a key role in the prophets' recording of the revelation they seen",
                            "He who is the Word of God speaks all thing into existence and pronounces judgement"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 102",
        "date": 1637969188145,
        "id":  "theology-102-week-4",
        "tags": 
        [
            "Theology","Trinity","God"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "The Trinity"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "The trinity is a doctrine stating that God is absolutely and eternally one essence subsisting in three distinct and ordered persons without any division or replication",
                            "The trinity is defined using negative statements which is known as apophatic theology",
                            "Division and replication both results in three gods which the Trinity is not stating in their definition",
                            "sub: This will lead into many heresies hence the reasons of the cults of old and today",
                            "<li>Each person of the trinity possess equally the full and divine essence of God",
                            "Modes of subsistence reveals the personal properties that distinguish each member of the Trinity",
                            "sub: Father, Son, and Holy Spirit",
                            "These relationships establish a definite order within the Trinity, so with respect to relationship ONLY not essence or glory. (1. Father, 2. Son, 3. Holy Spirit)",
                            "Psalm 45:6-7 refers to the Messiah as \"God\" and is enthroned, having been anointed by \"God\"",
                            "New Testament writer identify that Jesus is the Lord that the psalmist is speaking of in Psalm 110:1",
                            "sub: The Son is both elohim and adonai",
                            "<li>The Shema in Deuteronomy 6:7 allows for a plurality in God",
                            "The word one in the Hebrew \"ekhad\" affirms God's unity while also allowing for plurality. Gen 2:24 is a example \"one\" flesh even though there is two people",
                            "OT presents the angel of Yahweh as Yahweh and also distinct from Yahweh",
                            "sub: (Ex. 23:20-23) Yahweh sent the angel of Yahweh",
                            "<>Wisdom may be depicted as a distinct entity, but NT writers speak of Christ as \"the wisdom of God\"",
                            "Scripture presents a emphasis on the number three such as the seraphim in (Isa. 6:3)",
                            "(Isa. 48:12-16) This passage from the Old Testament presents at least two distinct entities",
                            "The early church saw the threefold blessing as an indication as three persons of the Trinity",
                            "During the great commission Jesus told His disciples to baptize in the \"name\" which is singular",
                            "sub: cf. Mat. 28:19"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 102",
        "date": 1637398837075,
        "id":  "theology-102-week-3",
        "tags": 
        [
            "Theology","Trinity","God"
        ],
        "image": 
        {
            "name": "images/bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Attributes of God"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "Here's what I learned this week studying the attributes/perfections of God: :listPlace(001)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mayhue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "God is not dependent on no one or nothing. This is a common thought that we as human love to think that we can give something to God or God is somehow wouldn't be God if we don't choose Him for our salvation",
                            "God's immutability, this is something that I would've used to an Arminian brother or sister in understanding that since God doesn't change and He has decreed His elect from the being. I thought this would've been a good argument, but reading this section understanding that open theist and their disbelief in God's immutability.",
                            "Immutability does not mean that God is static, nor that He doesn't act distinctly in time or possess true affections",
                            "Anthropopathic language is God's figurative expression of how He explains His change in actions towards a person",
                            "His infinitude with regard to time is eternity, and His infinitude with regard to space is omnipresence",
                            "God can experience time, but he is not controlled, confined, or condition by time",
                            "God upholds the created order by being in every point of space",
                            "God does know what would have happened if circumstances would have been different, but they aren't possible because they are not apart of God's plan",
                            "God's knowledge is perfect He is never learning, so He does not have to look into the future to see how would accept His salvation",
                            "God's knowledge has two aspects: Natural knowledge and free knowledge",
                            "sub: Natural Knowledge: is His self-conscious knowledge of Himself",
                            "sub: Free Knowledge: all things that become known in time by His sovereign will, all things that do not become known in time, and how He is manifested and not manifested by all things outside of Him",
                            "His natural knowledge is how He reveals himself to creation",
                            "We as creation can know God through His free knowledge because He decrees of how He would reveal Himself to creation",
                            "God's foreknowledge is not dependent on foresight of what humans would do",
                            "Scripture reveals God's power (Eph. 3:20)",
                            "God's power is that he has a theoretical absolute power to do more than what He actually does but not inconsistent with His essence",
                            "Doctrine of divine perfection is the doctrine of divine blessedness"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    }
]