[
    {
        "title": "Theology 103",
        "date": "1644825601000",
        "id":  "theology-103-week-5",
        "tags": 
        [
            "Theology","Christ","Sin","Angels","Demons"
        ],
        "image": 
        {
            "name": "bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 5: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mehue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "links":
                [
                    {
                        "id": "001",
                        "text": "",
                        "website": "laboris"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Satan can serve God’s purposes in the realm of church discipline when repentance remains absent",
                            "Believers are to gird up the loins with truth which show they have a heart for battle because of their commitment to Christ",
                            "God has provided the breastplate of righteousness to protect the believer’s mind and emotions",
                            "Though Satan and one-third of the angel disqualified themselves from servest to the LORD, they weren’t completely banned from heaven",
                            "Satan will only bruise Christ heel (cause Him to suffer), while Christ will bruise Satan’s head (destroy him with a fatal blow)",
                            "When someone is demonize, the demon exercise living and dominant control over that person",
                            "The sealing ministry of the Holy Spirit protects Christians against demon invasion, and its unbiblical and impossible for a true believer to have a demon invasion",
                            "Demonization refers to the only unbelievers in whom a demon resides",
                            "Believers can be tormented, oppressed, and harassed externally, even to to severe degree like Saul",
                            "A demon is far more powerful than a human so we must trust the appeal to God in prayer to deal with situation of demonization",
                            "The angel of the LORD has been identified as a special created angel, some say Michael the archangel, but no created angel has ever show traits of deity",
                            "Also the angel of the LORD is a self-manifestation of Yahweh himself",
                            "The angel of the LORD showed traits of deity (Ex, 3:2-5; Judg. 13:17-18; Ex. 23:21;33:14; Isa. 63:9)",
                            "The identification of the angel of the LORD matches the NT explanation of the preincarnate Christ",
                            "The words uttered by Christ asserts that He was the angel of the LORD mentioned in the OT because it asserts that more than one person can be God",
                            "The attributes of the OT angel of the LORD compare perfectly with those of Christ"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "How can demons be pictured in today’s age, such as in a homeless person who is talking to themselves, or can it be your average person?",
                            "If one is demon possessed what do we do as Christians?",
                            "Will the Antichrist be some type of leader like the king of Babylon in Isaiah 14?",
                            "What portion in man’s sinful action is Satan or demon deception; or just the man’s own sinfulness? (The Devil made me do it theology)"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    },
    {
        "title": "Theology 103",
        "date": "1644220801000",
        "id":  "theology-103-week-4",
        "tags": 
        [
            "Theology","Christ","Sin","Angels","Demons"
        ],
        "image": 
        {
            "name": "bible-icon.png",
            "alt": "bible-icon"
        },
        "content":
        [
            {
                "title":
                {
                    "tag": "h2",
                    "text": "Week 4: Humans and Sin, Angels and Demons"
                },
                "paragraphs": 
                [
                    " :imagePlace(001)",
                    "These are the following learning that I was grateful to learn about this week: :listPlace(001)",
                    "I still have questions on the following: :listPlace(002)"
                ],

                "images":
                [
                    {
                        "id": "001",
                        "alt": "biblical-doctrine",
                        "caption": "MacArthur/Mehue Biblical Doctrine",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],

                "lists":
                [
                    {
                        "id": "001",
                        "items": 
                        [
                            "Angels(both holy and evil) were created at the start of creation and the demons fell somewhere after the seven day creation and prior to the fall. They existed with a set number and 1/3 of them falling",
                            "The term “heaven” in scripture describes three different elevation levels above earth.",
                            "“Third heaven” normally known as paradise where God resides",
                            "“Second heaven” where the sun, moon, and stars reside",
                            "“First heaven” earth’s atmosphere",
                            "Angels are ministering spirits this is presented in Heb. 1:14",
                            "“God of this world” is Satan and he has superior power, but not deity. This title comes by virtue not his position nor his nature. The reason behind the title is Satan’s work in the garden that cause the fall, and he is behind all false religions",
                            "Satan’s messages and activities are all built on deception and lies (1 Ki. 22:21-23)",
                            "God used Satan to deceive Israel’s King Ahab to go into battle which led to Ahab’s death",
                            "Satan and other demonic minions were most intensely engaged during Christ’s earthly ministry",
                            "Satan operates as the unrivaled master of disguise who also mimics and imitates the holy things of God, but gives his cheap version, which lures people to himself",
                            "Satan wages an invisible spiritual war using deceitful and clever tactics",
                            "Satan’s target is the human mind more importantly the Christian’s mind as he plays mind games with them",
                            "Satan attempt to distort or deny the truth God’s Word by sensualism, sensationalism, universalism, rationalism, existentialism, illusionism, ecumenism, humanism",
                            "The question that Satan asked Eve in the garden was not a research question, but rather a ridicule",
                            "Ex: You’ve got to be kidding, Eve. God didn’t really say you can’t eat from any tree in the garden, did he?",
                            "In the moment when Eve was deceived God’s Word was no longer authoritative in her life now that she had an alternative"
                        ],
                        "list_type": "ordered"
                    },
                    {
                        "id": "002",
                        "items": 
                        [
                            "How can demons be pictured in today’s age, such as in a homeless person who is talking to themselves, or can it be your average person?",
                            "If one is demon possessed what do we do as Christians?",
                            "Will the Antichrist be some type of leader like the king of Babylon in Isaiah 14?",
                            "What portion in man’s sinful action is Satan or demon deception; or just the man’s own sinfulness? (The Devil made me do it theology)"
                        ],
                        "list_type": "ordered"
                    }
                ]
            }
        ]
    }
]