[
    
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "Since the enlightenment, humans have thought of themselves as inherently “good”Representative headship asserts that the action of a representative results is seen as the action also for those united to him.The action of our federal head lead to not only a sinful nature, but also our condemnation, so in the same the action by our new federal head Christ we receive life. (Rom. 5 &amp; 1 Cor. 15)Total depravity does not conclude that man is not able to do good rather it teaches that the corruption of sin pollutes the person. Both body and spirit are corrupted by sin.Man is not relatively neutral in which they are able to accept or reject God. Man is a hater of God who can not understand the things of GodThe “sin that leads to death” is a sin that lead to drastic chastisementMortal and Venial sins are antithetical to the bible because it supposes that there are some sins that won’t lead to condemnation which in turn leads to a faulty salvationThe Roman Catholic idea of meritorious penance which is used for removal of mortal sin is an error and takes a blow at Christ atoning sacrifice for sin.Personal sin does not break the bond between them and Christ, but they do have a negative impact on communion with Christ.God created the world perfect, the reason the world is the way it is, is because man has to face the consequences for their sin.The truth gives eternal perspective to our temporal sufferings in a fallen world.UNANSWERED QUESTIONS (at least 3)Is this denial from this British monk the reason why so many believe in free will?In understanding the a-mil or post-mil position on the end times, how can it be that the man of lawlessness isn’t literally or has already come and deceived?Why was the woman promised the coming seed that would reverse the curse?Why did God not destroy all man again as he did in the flood even though man remained sinful as we see even Noah was sinful?"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1643616001000,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Week 3 Theology 103: Humans and Sin, Angels and Demons"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "Theology 103: Humans and Sin, Angels and DemonsNEW INSIGHTSAnthropology helps me with understanding who I am as a person. This answers the question of why we all are here.Anthropology also helps with dealing with the time such as what Charles Spurgen dealt with evolution starting with Charles Darwin. This is where I am happy to learn about sudden creationism.&nbsp;I noticed while going through Genesis 1 were the terms created, made, and formed. This was eye opening because I sometimes can gloss over these terms while reading and miss God's magnificent glory in creation.Imago Dei is a unique difference that we humans possess that all other creatures and animals don’t possess. We are his representation not in the divine sense, but in the sense of the Trinitrian nature how we live in relationship with others&nbsp;&nbsp;Our conscience can get overridden by lies and errors which in turn misinforms the conscience.Scripture seems to support dichotomy and trichotomy where sometimes soul and spirit are interchangeable and other times they are not so interchangeable, but mean different thingsCreationism argument when it comes to the origin of the soul fails to understand that Adam creation is a unique creation, so using him for the argument that both the soul and body were created at the same time is wrong.Deut. 22:5 supports that God expects that said person to live according to the gender He granted them at birthAfter the creatures were created God seemed to still create Adam a helper, so we see that the creatures and animals weren’t suitable for him.Homosexual unions cannot be rightly seen as marriages because it goes against God meaning for marriage.He create man and seen that man needed a companion and&nbsp; this companion must fulfill His command to procreateEx. 21:22-25 presents a strong case for life starting in the womb because of the severity of the punishment if the child in the mother is harmed.The soul/spirit lives in an intermediate state between death and bodily resurrection.UNANSWERED QUESTIONSCan one human constitution affect another human constitution?Similar to man initial command and go and fill the earth which they disobey which led to Gen. 11 in which they gathered in one place; is our command to go and make disciples of all nations can we be disobedient if we stick to trying to make disciples and our household and extended families?When talking about the role of government, is it wrong to disobey when they constitute something as being wrong such as the latest Canadian bill even though they are in place to punish people who do wrong?"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1643011201000,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Week 2 Theology 103: Humans and Sin, Angels and Demons"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "Doxologies of the NT ascribe the same glory and honor to Christ as was the&nbsp;commonality to ascribe to God in the OT (1 Chr. 29:10-11;1 Pet. 4:11;2 Pet. 3:18)Jesus instructs His disciples to pray to Him(Jh. 14:14;15:16;16:23-24) and we look at those passage we see that He describes Himself as our mediator between God and manChrist in emptying Himself in Phil. 2 did not empty Himself of His deity, but rather emptying by addition, not subtraction, by becoming man.The Son of God fully possessed His divine nature, attributes, and prerogatives, he did not fully express them. They were veiled to be revealed by Him when he wantedChrist surrender the glories from which He came, from being worshipped by saints and angels to mocked by menBoth Jesus’s divine nature and human nature possesses their own will. (Jh. 17:24) His divine will; (Mat. 26:39) His human willHis limited knowledge such as in passage like Mark 13 is a result of His voluntary surrender of the independent use of His divine attributesJesus was baptized in order to fulfill the Father’s will. He in turned identified Himself with sinners to ultimately bear their sinsJesus veiling the truth in parables acted as both judgement and mercy for the hearers. Judgement because it kept them in darkness and mercy because He grant them to see the lightGod prepared mankind for the atoning substitutionary sacrifice&nbsp;of Christ by providing the instructions about sacrificeThe display of Jesus’s glory is most often associated with His second advent, not His resurrection&nbsp;Glory in the minds of the prophets and apostles were mostly associated with Christ’s resurrectionThe believers resurrection they share in the same gloryEvery believer is ultimately accountable to him (1 Cor. 3:10-15) which motivates us to please GodAt the fullness of time, God will gather together believers in the millennial kingdomThe real glory of eternity is when believers will reside in the presence of the Lord"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1639369440000,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "THEOLOGY 102 WEEK 6 CHRISTOLOGY PT.2"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "Christ is eternally begotten from the Father, this is not speaking that Christ had a beginning because that goes against John 1:2-3Begotten in an eternal sense is speaking of the relationship of the First and Second person of the TrinityThe Holy Spirit is not begotten, but rather processionWhen talking about order in the Trinity we are not speaking of glory, majesty, or essence, but rather with relationshipThe word Trinity is not found in found in Scripture but it is based on the biblical verbiage presentedThe doctrine of the Trinity was formally articulated by the Councils of Nicea(AD 325) and Constantinople(AD 381), but weren’t invented hereThe term arised to combat heresies that were arising from Gnosticism and MonarchianismChrist (Second person of the Trinity) was sent from the Father as a result of God’s love for mankind (John 3:16)Christ has always existed as the Son of God but became a child only at the moment of His miraculous conception“Son of God” title was understood categorically by everyone as a title of deityTheophany meaning appearance of God usually is referred to the old testament and are seen in passage like Gen. 16: 7-3 and has to be seen through the author rather than the characterAs we read John 1:18 we see that “no one has seen God...,he has made him known” made known in greek (​​exēgeomai)Jesus (the Son of God) made the Father known to mankindWe see Christ intervening in history when mankind rebelled along with establishing the Kingdom of God on earthThe point of the word “God-breathed” points to the origin of Scripture which is the divine breath of the Holy SpiritThe Son of God appears as the one speaking to the people both in the OT and NTChrist is the theophany giving revelation by means of His personal presenceThe Spirit plays a key role in the prophets’ recording of the revelation they seenHe who is the Word of God speaks all thing into existence and pronounces judgement"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1638636277590,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Theology 102 Week 5 Christology "
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "The trinity is a doctrine stating that God is absolutely and eternally one essence subsisting in three distinct and ordered persons without any division or replicationThe trinity is defined using negative statements which is known as apophatic theologyDivision and replication both results in three gods which the Trinity is not stating in their definitionThis will lead into many heresies hence the reasons of the cults of old and todayEach person of the trinity possess equally the full and divine essence of GodModes of subsistence reveals the personal properties that distinguish each member of the TrinityFather, Son, and Holy SpiritThese relationships establish a definite order within the Trinity, so with respect to relationship ONLY not essence or glory. (1. Father, 2. Son, 3. Holy Spirit)Psalm 45:6-7 refers to the Messiah as “God” and is enthroned, having been anointed by “God”New Testament writer identify that Jesus is the Lord that the psalmist is speaking of in Psalm 110:1The Son is both elohim and adonaiThe Shema in Deuteronomy 6:7 allows for a plurality in GodThe word one in the Hebrew “ekhad” affirms God’s unity while also allowing for plurality. Gen 2:24 is a example “one” flesh even though there is two peopleOT presents the angel of Yahweh as Yahweh and also distinct from Yahweh(Ex. 23:20-23) Yahweh sent the angel of YahwehWisdom may be depicted as a distinct entity, but NT writers speak of Christ as “the wisdom of God”Scripture presents a emphasis on the number three such as the seraphim in&nbsp; (Isa. 6:3)(Isa. 48:12-16) This passage from the Old Testament presents at least two distinct entities&nbsp;The early church saw the threefold blessing as an indication as three persons of the TrinityDuring the great commission Jesus told His disciples to baptize in the “name” which is singularcf. Mat. 28:19"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1637969188145,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Week 4 Theology 102 (The Trinity)"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ibb.co/563qGkX/biblical-doctrine-cover-half.jpg"
                    }
                ],
                "paragraphs": [
                    "Here's what I learned this week studying the attributes/perfections of GodGod is not dependent on no one or nothing. This is a common thought that we as human love to think that we can give something to God or God is somehow wouldn’t be God if we don’t choose Him for our salvationGod’s immutability, this is something that I would've used to an Arminian brother or sister in understanding that since God doesn’t change and He has decreed His elect from the being. I thought this would’ve been a good argument, but reading this section understanding that open theist and their disbelief in God’s immutability.Immutability does not mean that God is static, nor that He doesn’t act distinctly in time or possess true affectionsAnthropopathic language is God’s figurative expression of how He explains His change in actions towards a personHis infinitude with regard to time is eternity, and His infinitude with regard to space is omnipresenceGod can experience time, but he is not controlled, confined, or condition by timeGod upholds the created order by being in every point of spaceGod does know what would have happened if circumstances would have been different, but they aren’t possible because they are not apart of God’s planGod’s knowledge is perfect He is never learning, so He does not have to look into the future to see how would accept His salvationGod’s knowledge has two aspects: Natural knowledge and free knowledgeNatural Knowledge: is His self-conscious knowledge of HimselfFree Knowledge: all things that become known in time by His sovereign will, all things that do not become known in time, and how He is manifested and not manifested by all things outside of HimHis natural knowledge is how He reveals himself to creationWe as creation can know God through His free knowledge because He decrees of how He would reveal Himself to creationGod’s foreknowledge is not dependent on foresight of what humans would doScripture reveals God’s power (Eph. 3:20)God’s power is that he has a theoretical absolute power to do more than what He actually does but not inconsistent with His essenceDoctrine of divine perfection is the doctrine of divine blessedness"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1637398837075,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Week 3 Theology 102 "
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://firebasestorage.googleapis.com/v0/b/devblog-322120.appspot.com/o/documents%2FBlogCoverPhotos%2F2A28314F-00FF-4B63-99D0-D45F4E6984A6.jpeg?alt=media&token=1940f593-c644-4e32-9a6b-1ca3b2050881"
                    }
                ],
                "paragraphs": [
                    "As I embraced the task of creating a website, I ran into some problems. Those problems were choosing the right framework. There are many out there from React, VueJS, and even embedded JavaScript. So the one that rose to the top of my list was React. I find React to be very powerful for something that seems so simple to use. There are many things that React offered that the others did not such as CSS animation. Working in VueJS I found it fairly difficult to work with CSS animation. I would’ve just JavaScript to handle my animations, but I don’t need all that power when it something simple as moving a div.My overall appreciation of React is great!"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1636423946203,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Web Development Choice"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ytimg.com/vi/JsT2ASvaSHY/maxresdefault.jpg"
                    }
                ],
                "paragraphs": [
                    "I have been golfing for about three months now and I have been trying to train myself. I am trying to be able to consistently hit solid irons on the coarse I see my biggest flaws is always moving behind the ball. This is what normally cause me to always hit the ball fat or thin.Here's a video I think should help me with that along with many others from Scratch Golf Academy."
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1629245506291,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Hit The Iron Consistently "
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://img.youtube.com/vi/JmWixril3pg/maxresdefault.jpg"
                    }
                ],
                "paragraphs": [
                    "So, I came across a video from a channel that I watch that seemed to help with my swing. This teacher goes step by step on how to get the left arm straight in your golf swing."
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1628826537217,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Working on my Lead Arm in Swing"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ytimg.com/vi/6S4LCPI9wk4/maxresdefault.jpg"
                    }
                ],
                "paragraphs": [
                    "As being a new father I felt like this video was very helpful for setting ground rules for my kids as they grow up.Three Rules to Live by as a Parent:No lyingNo disobedience No disrespecting your motherWe shouldn’t over complicate things for our children. These rules not only established ground with you and your child, but also allows your child to critical think. "
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1628742217550,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Fathering with Few Rules"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://i.ytimg.com/vi/QQ_tDNyp_HU/hqdefault.jpg"
                    }
                ],
                "paragraphs": [
                    "Saiko comments on Ruslan comments on Voddie Baucham plagiarism accusations.Very interesting discussion of handling brothers in Christ. This video is about a 2 hr response."
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1628656444876,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Questions About Plagiarism"
    },
    {
        "content": [
            {
                "images": [
                    {
                        "alt": "",
                        "caption": "",
                        "id": "001",
                        "link": "https://img.youtube.com/vi/fX13R5lO_WE/maxresdefault.jpg"
                    }
                ],
                "paragraphs": [
                    "Message from CompassHB Rom 6:1-16 August 7th 2021"
                ],
                "title": {
                    "tag": "",
                    "text": ""
                }
            }
        ],
        "date": 1628383768190,
        "id": "",
        "image": {
            "alt": "",
            "name": ""
        },
        "tags": [],
        "title": "Great sermon"
    }
]